Tekla.Structures.Dialog.Dialogs
The Dialogs class contains interface methods for Tekla Structures to handle FormBase and WindowBase dialogs.

Tekla.Structures.Dialog.Dialogs.GetPluginFormBaseByPluginFormName(System.String)
Retrieves an instance of the form.
pluginFormName: The complete name of the plug-in form (including the plug-in name).
Returns: The existing PluginFormBase or null if it did not exist.

Tekla.Structures.Dialog.Dialogs.GetPluginWindowBaseByPluginFormName(System.String)
Retrieves an instance of the form.
pluginFormName: The complete name of the plug-in form (including the plug-in name).
Returns: The existing PluginWindowBase or null if it did not exist.

Tekla.Structures.Dialog.Dialogs.LoadDialogs(System.String)
Reads the PluginFormBase and PluginWindowBase dialogs from all found dll files in bin\dialogs and bin\plugins.
param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.GetAttributeFileNameAndDialogName(System.String@,System.String@)
Since AKIT doesn't allow us to transport any parameters directly, we have to fetch them from Core at this point.
attributeFileName: The name of the attribute file.
pluginFormName: The full name of the dialog (should contain Plugin name)

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndSave(System.String)
Uses the attributes found from the attribute file for the specified dialog and saves to file.
param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndApply(System.String)
Uses the attributes found from the attribute file as the applied values for the specified dialog.
param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndModify(System.String)
Uses the attributes found from the attribute file as the current values for the specified dialog.
Modifies the current selected instance. Applied values for this dialog are not changed.
param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndApply(System.String,System.String)
Loads the specified dialog's applied values from the attribute file.
attributeFileName: The name of the attribute file.
pluginFormName: The full name of the dialog.
Returns: True on success.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndModify(System.String,System.String)
Loads the specified dialog's current values from the attribute file and modifies the current selected instance.
attributeFileName: The name of the attribute file.
pluginFormName: The full name of the dialog.
Returns: True on success.

Tekla.Structures.Dialog.Dialogs.ReloadDialogs(System.String)
Reloads all PluginFormBase dialogs with default/standard values.
param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs.SetSettings(System.String)
Forces the dialog system to get the language and localization settings from Tekla Structures.
param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs._lastOpenedDialog
Because we dont support multiple dialog we need to save the last opened dialog.

Tekla.Structures.Dialog.Dialogs.OpenDialog(System.String)
Opens a dialog. The name of the dialog is asked from the Tekla Structures core.
param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs.OpenDialogAndGet(System.String)
Opens a dialog and forces it to get the values from the currently selected part.
param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileToStack(System.String)
Opens a dialog and forces it to get the values from the currently selected part.
param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs.LoadValuesToStack(System.String,Tekla.Structures.DialogInternal.AttributeManager,System.Type)
Loads the dialog values from a file to stack
fileName: The name of the file.
manager: The attribute manager of the dialog.
dialogType: The type of the dialog.

Tekla.Structures.Dialog.Dialogs.PerformRefreshForm(Tekla.Structures.Dialog.Dialogs.ExistingDialog)
Method for performing dialog form refresh when opened while already open.
dialog: Existing dialog.

Tekla.Structures.Dialog.Dialogs.PerformDialogFormGet(Tekla.Structures.Dialog.Dialogs.ExistingDialog)
Method for getting dialog values.
dialog: Existing dialog.